#include <stdio.h>
/*
%g %G 실수형 자동출력(부동 또는 고정 소수점 / 더 짧은거)
*/
void main() {

	//8,10,16 진수 정수 표현
	printf("%d %i \n", 16, 16); // 10진수
	printf("%o %#o \n", 16, 16); // 8진수
	printf("%x %#x %#X \n\n", 10, 10, 10); // 16진수

	//정수형
	printf("\t[정수형]\n");
	//10
	printf("%010d %s \n", 12345, "%010d"); //0000012345
	printf("%+010d %s \n", 12345, "%+010d"); //+000012345
	//8
	printf("%10o %s \n", 271, "%10o"); //_______417
	printf("%0#10o %s \n", 271, "%0#10o"); //0000000417
	printf("%-#10o %s \n", 271, "%-#10o"); //0417______
	//16
	printf("%0#10x %s \n", 271, "%0#10x"); //0X0000010f
	printf("%-#10x %s \n", 271, "%-#10x"); //0X10f_____

	//실수형
	printf("\t[실수형]\n");
	printf("%f %s \n", 123456.789, "\t%f"); //123456.789000
	printf("%10.3f %s \n", 123456.789, "\t%10.3f"); //123456.789
	printf("%e %s \n", 123456.789, "\t%e"); //1.23456789e+05
	printf("%10.3E %s \n", 123456.789, "\t%10.3f"); //_1.235e+05	반올림 하나봄
	printf("%g %s \n", 12.34e-5, "\t%g"); //0.0001234 
	printf("%G %s \n\n", 12.34e-5, "\t%G"); //1.234e-05

	//문자형
	printf("\t[문자형]\n");
	printf("%s \n", "1234"); //1234
	printf("%10.3s \n", "Hello"); // _______Hel
	printf("%-10.3s \n", "Hello"); //Hel_______
	printf("%10.*s \n", 4, "Hello"); //______Hell     * 자리에 숫자가 들어감
	printf("%0+10.1f%s \n", 3.25, "Hello"); // +0000003.3Hello
}